cf/Documents/ТехЗаключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ТехЗаключение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неисправность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Неисправности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеисправностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаключенияНеисправностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ТехЗаключение/Ext/ManagerModule.bsl
Функция ПечатьТехЗаключение(Ссылки) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет 			= Документы.ТехЗаключение.ПолучитьМакет("Заключение");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьТело 	= Макет.ПолучитьОбласть("Тело");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номер, Дата, Ответственный,
	|	ЗаказНаряд.Номер НомерЗаказа, ЗаказНаряд.Дата ДатаЗаказа, ЗаказНаряд.Контрагент Контрагент,
	|	Номенклатура, Номенклатура.Артикул Артикул,
	|	Неисправность, Причина, Заключение
	|ИЗ
	|	Документ.ТехЗаключение 
	|ГДЕ
	|	Ссылка В(&Ссылки) И НЕ ПометкаУдаления
	|");
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьТело.Параметры.Пользователь = ВернутьДолжностьИПользователя(); 
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьТело.Параметры.Заполнить(Выборка);
		
		ОбластьШапка.Параметры.Дата 		= Формат(ОбластьШапка.Параметры.Дата, "ДЛФ=DD");
		ОбластьШапка.Параметры.ДатаЗаказа 	= Формат(ОбластьШапка.Параметры.ДатаЗаказа, "ДЛФ=DD");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьТело);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВернутьДолжностьИПользователя()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ТекущийПользователь.ФизЛицо.Пустая() Тогда //Если не заполнено ФИЗ лицо
		ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.Наименование, "Р", ,"ФИО");
		ДолжностьИПользователь = ФИОПользователя;
	Иначе
		Если ЗначениеЗаполнено(ТекущийПользователь.ФизЛицо.Должность) Тогда //Есть у ФИЗ лица есть должность
			ДолжностьПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Должность, "Р", ,"Д");
            ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Наименование, "Р", ,"ФИО");
			ДолжностьИПользователь = ДолжностьПользователя + " " + ФИОПользователя;
		Иначе
			ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Наименование, "Р", ,"ФИО");
			ДолжностьИПользователь = ФИОПользователя;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ДолжностьИПользователь;
	
КонецФункции
